
#Область ПрограммныйИнтерфейс

// Проводит валидацию значения согласно шаблону.
// 
// Документация: https://github.com/ibrusniak/Validok
// 
// Параметры:
//		Значение - значение любого типа, поддерживаемого валидатором.
//		см. функцию "ПоддерживаемыеВалидаторомТипыЗначения();
//
//		Шаблон - Строка - шаблон валидации в виде строки в нотации JSON.
//		см. документацию: https://github.com/ibrusniak/Validok
// 
// Возвращаемое значение:
//
//		Структура с полями:
//			* Результат - Булево - результат валидаци, пройдена или нет.
//			* Ошибки - Соответствие - ошибки валидации
//
Функция Валидация(Значение, Шаблон) Экспорт

	

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив значений типа Тип, которые поддерживаются валидатором.
// 
// Возвращаемое значение:
//		тип - Массив элеметов типа Тип
//
Функция ПоддерживаемыеВалидаторомТипыЗначения()

	МассивПоддерживаемихТипов = Новый Массив;
	
	Возврат МассивПоддерживаемихТипов;

КонецФункции

#КонецОбласти
